package com.javarush.task.task01.task0122;

/*
Поиск ошибок

Исправь ошибку в программе. Нужно чтобы программа выводила на экран число 100.

Требования:
1. Программа должна выводить на экран текст.
2. Должно быть объявлено 3 переменные.
3. Тип переменных менять нельзя.
4. Значения переменных менять нельзя.
5. В программу нельзя добавлять новые строки или удалять имеющиеся.
6. Внеси минимальные изменения в команду вывода.
7. Выведенный текст должен соответствовать заданию.
*/

public class Solution {
    public static void main(String[] args) {
        int a = 56;
        int b = 30;
        int c = 14;
        System.out.print(a + b + c);
    }
}
