package com.javarush.task.task01.task0119;

/*
Мне снова 15(!)

Внеси изменения в программу, чтобы переменная age имела значение 15.

Требования:
1. Должно быть объявлено 4 переменных.
2. Тип переменной age должен быть int.
3. Всем переменным должны присваиваться значение сразу после создания.
4. Значение, которое присваивается переменной age, должно быть равно 15.
*/

public class Solution {
    public static void main(String[] args) {
        String name = "Amigo";
        int age = 15;
        int money = 500;
        int weight = 70;
    }
}